app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WlFl46tE7PrAJZWENNG1zg"], ["updated_at", "2019-11-05 18:10:37.149587"], ["id", 4]]